<?php
// 変数に値を代入し、
// その値が50より大きければ
// 「50より大きい」
// 50より小さければ
// 「50より小さい」
// 50と同値であれば
// 「50です」
// という文字列を出力してください。

// また最低限どういう値でテストすればいいか
// 確認したテスト値をコメントアウトですべて示してください。

$x=31;
if($x>50){
    echo "「50より大きい」";
}else if($x<50){
    echo "50より小さい";
}else{
    echo "「50です」";
}
//「50より大きい」
//C:\Users\kousu\OneDrive\デスクトップ\01_PHP基礎 アルゴリズム\01_PHP蝓ｺ遉・繧｢繝ｫ繧ｳ繧吶Μ繧ｹ繧吶Β\01_php_bas   se>php lesson03.php
//「50です」
//C:\Users\kousu\OneDrive\デスクトップ\01_PHP基礎 アルゴリズム\01_PHP蝓ｺ遉・繧｢繝ｫ繧ｳ繧吶Μ繧ｹ繧吶Β\01_php_bas   se>php lesson03.php
//50より小さい