<?php
// 以下をfor文を使用して表示してください。
// ヒント: if〜elseifを使用

// ****1
// ***121
// **12321
// *1234321
// 123454321
// *1234321
// **12321
// ***121
// ****1

//for(カウンタの初期値; ループ処理の条件式;増減式)
//for($x = 1 ; $x >= a ; $x--)a以下まで継続。
//for($x = 1 ; $x <= a ; $x--)a以上まで継続。
for( $abcd = 1; $abcd <= 9; $abcd++){//9回転のfor文
    if( $abcd <= 5){   //$abcdを5まで継続。(1,2,3,4の4回転)ifで条件分岐
        for($a = 4; $a >= $abcd; $a--){//4.3.2.1で＊表示。
            echo "*";
        }
        for($b = 1; $b <= $abcd; $b++){//１～(0～5以下)まで継続。
            echo  $b;
        }
        for($c = $b-2; $c >= 1; $c--){//(スタート値)～1まで継続。
            echo $c;
        }
        echo "</br>";
    }
    else if( $abcd >=6){//6段目以降$abcdの上限9{6,7,8,9}まで継続.(4回転)
        for($d = 6; $d <= $abcd; $d++){//スタート値6～$abcd{6,7,8,9}まで
            echo "*";
        }
        for($a = 1; $a <= 11-$d; $a++){
            echo $a;
        }
        for($cat = 10-$d; $cat >= 1; $cat--){
            echo $cat;
        }
        echo "</br>";
    }
}
echo "</br>";
// *1234321
// **12321
// ***121
// ****1


















//for($a = 1 ; $a <= 9 ; $a ++){
//  if($a <= 5){
//   echofor($b = 4 ; $b >= $a ; $b --){
//        echo "*";
//       }
//      for($c = 1; $c <= $a ; $c++){
//      echo $c;
//      }
//      for($d =$c -2 ; $d >= 1 ; $d--){
//      echo $d;
//        }
//        echo "</br>";
//    }
//    else if($a >=6 ){
//        for($e = 6 ; $e <= $a ; $e++){
//        echo "*";
//        }
//        for($f = 1 ; $f <=10-$a  ; $f++){
//        echo $f;
//        }
//        for($g = $f-2 ; $g >=1  ; $g --){
//        echo $g;
//        }
//    echo "</br>";
//    }
//}