<?php
// 以下をfor文を使用して表示してください。

// ****5
// ***545
// **54345
// *5432345
// 543212345

for ($a = 5; $a >= 1; $a--) {
    for ($b =$a-1; $b>=1 ; $b--) {
        echo  "*";
    }
    for ($y = 5 ; $y >= $a ; $y--) {
        echo $y;
    }
    for ($x = $y+2; $x <= 5; $x++) {//16のここから理解まだ。
        echo $x;
    }
        echo "</br>";
}


/*
for($a=4;$a>=0;$a--){

    $i=$a+1;

    for($b=1;$b<=$a;$b++){

        echo "*";

    };

    for($c=5;$c>=$a+1;$c--){

        echo $c;

    };

    for($d=4;$d>$a;$d--){

        $i++;

        echo $i;

    };

    echo "<br>";

};


//以下理解。
for ($a = 5; $a >= 1; $a--) {
  for ($b = 1; $b <= $a - 1; $b++) {
    echo "*";
  }
  for ($c = 5; $c >= $a; $c--) {
    echo $c;
  }
  for ($d = $a + 1; $d <= 5; $d++) {
    echo $d;
  }
  echo "<br/>";
}
// ****5
// ***545
// **54345
// *5432345
// 543212345

//for($x = 1 ; $x >= 3 ; $x--)三以下まで継続。
//for($x = 1 ; $x <= 3 ; $x--)三以上まで継続。

for($a=1; $a<=5; $a++){
    for($b=1; $b<=$a; $b++){
        echo $b;
    }
    echo "</br>";
}

//できるだけ固定の数字を使った方がわかりやすい。

for ($a = 1; $a <= 5; $a++) {
  for ($b = 4; $b >= $a; $b--) {
    echo "*";
  }
  for ($c = 5; $c >= 6 - $a; $c--) {
    echo $c;
  }
  for ($d = $c + 2; $d <= 5; $d++) {
    echo $d;
  }
  echo "<br/>";
}
*/


